{t alias="В этом разделе можно задать расположение блоков на различных страницах.."}В этом разделе можно задать расположение блоков на различных страницах.
Блок - это видимая часть модуля, которая может отображать пользователю определенную информацию. 
Каждый модуль может содержать множество блоков, например модуль "Каталог" может содержать блоки: "список категорий", "список товаров в категории", "посление просмотренные товары", и т.д.
<p>Секции необходимы, чтобы задавать структуру страницы по сетке и удерживать блоки или вложенные секции согласно заданной ширине.</p>
{/t}