{t alias="ПОЛИТИКА ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ"
firm_name = $CONFIG.firm_name
}
<h2>ПОЛИТИКА ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>

<p><strong>1. Введение</strong></p>
<p>1.1. Политика обработки персональных данных у «%firm_name» (далее – Политика) разработана в соответствии с Федеральным законом от 27.07.2006. №152-ФЗ «О персональных данных» (далее – ФЗ-152).</p>
<p>1.2. Настоящая Политика определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных у «%firm_name» (далее – Организация) с целью защиты прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.</p>
<p>1.3. Персональные данные являются конфиденциальной, строго охраняемой информацией и на них распространяются все требования, установленные внутренними документами Организации к защите конфиденциальной информации.</p>

<p><strong>2. Понятие и состав персональных данных.</strong></p>

<p>2.1. Перечень персональных данных, подлежащих защите в Организации, формируется в соответствии с ФЗ РФ от 27 июля 2006 г. № 152-ФЗ «О персональных данных» и документом «Соглашение на обработку персональных данных».</p>
<p>2.2. Сведениями, составляющими персональные данные, в Организации является любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных).</p>
<p>2.3. Организация обрабатывает персональные данные собственных сотрудников.</p>

<p><strong>3. Цели обработки персональных данных.</strong></p>

<p>3.1. Организация осуществляет обработку персональных данных  в целях оказания услуг, обеспечения выплат, оформления трудовых и иных договорных отношений, кадрового, бухгалтерского, налогового учета, а также в  иных целях, предусмотренных Федеральным законом от 27.06.2006 №152-ФЗ, 85-90 Трудового кодекса РФ.</p>

<p><strong>4. Сроки обработки персональных данных</strong></p>

<p>4.1. Сроки обработки персональных данных определяются в соответствии со сроком действия договора с субъектом персональных данных, Приказом Минкультуры РФ от 25.08.2010 № 558 «Об утверждении «Перечня типовых управленческих архивных документов, образующихся в процессе деятельности государственных органов, органов местного самоуправления и организаций, с указанием сроков хранения», сроком исковой давности, а также иными требованиями законодательства РФ.</p>

<p><strong>5. Права и обязанности</strong></p>

<p>5.1. Права и обязанности Организации</p>

<p>5.1.1. Организация как оператор персональных данных, вправе:</p>

<ul>
    <li>отстаивать свои интересы в суде;</li>
    <li>предоставлять персональные данные субъектов третьим лицам, если это предусмотрено действующим законодательством (налоговые, правоохранительные органы и др.);</li>
    <li>отказывать в предоставлении персональных данных в случаях предусмотренных законодательством;</li>
    <li>использовать персональные данные субъекта без его согласия, в случаях предусмотренных законодательством.</li>
</ul>

<p>5.2. Права и обязанности субъекта персональных данных</p>
<p>5.2.1. Субъект персональных данных имеет право</p>
<ul>
    <li>требовать уточнения своих персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными, устаревшими, недостоверными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав;</li>
<li>требовать перечень своих персональных данных, обрабатываемых Организацией и указание источника их получения;</li>
<li>получать информацию о сроках обработки своих персональных данных, в том числе о сроках их хранения;</li>
<li>требовать извещения всех лиц, которым ранее были сообщены неверные или неполные его персональные данные, обо всех произведенных в них исключениях, исправлениях или дополнениях;</li>
<li>обжаловать в уполномоченный орган по защите прав субъектов персональных данных или в судебном порядке неправомерные действия или бездействия при обработке его персональных данных;</li>
<li>на защиту своих прав и законных интересов, в том числе на возмещение убытков и (или) компенсацию морального вреда в судебном порядке.</li>
</ul>

<p><strong>6. Принципы и условия обработки персональных данных.</strong></p>

<p>6.1. Обработка персональных данных в Организации осуществляется на основе принципов:</p>

<ul>
    <li>законности и справедливости целей и способов обработки персональных данных;</li>
    <li>соответствия целей обработки персональных данных целям, заранее определенным и заявленным при сборе персональных данных, а также полномочиям Организации;</li>
    <li>соответствия объема и характера обрабатываемых персональных данных, способов обработки персональных данных целям обработки персональных данных;</li>
    <li>достоверности персональных данных, их достаточности для целей обработки, недопустимости обработки персональных данных, избыточных по отношению к целям, заявленным при сборе персональных данных;</li>
    <li>недопустимости объединения созданных для несовместимых между собой целей баз данных, содержащих персональные данные;</li>
    <li>хранения персональных данных в форме, позволяющей определить субъекта персональных данных, не дольше, чем этого требуют цели их обработки;</li>
    <li>уничтожения по достижении целей обработки персональных данных или в случае утраты необходимости в их достижении.</li>
</ul>

<p>6.2. Обработка персональных данных осуществляется на основании условий, определенных законодательством Российской Федерации.</p>

<p><strong>7. Обеспечение безопасности персональных данных.</strong></p>

<p>7.1. Организация предпринимает необходимые организационные и технические меры для обеспечения безопасности персональных данных от случайного или несанкционированного доступа, изменения, блокирования доступа и других несанкционированных действий.</p>

<p>7.2. В целях координации действий по обеспечению безопасности персональных данных в Организации назначен ответственный за обеспечение безопасности персональных данных.</p>

<p><strong>8. Заключительные положения.</strong></p>

<p>8.1. Настоящая Политика является внутренним документом Организации, общедоступной и подлежит размещению на официальном сайте Организации.</p>

<p>8.2. Настоящая Политика подлежит изменению, дополнению в случае появления новых законодательных актов и специальных нормативных документов по обработке и защите персональных данных, но не реже одного раза в три года.</p>

<p>8.3. Контроль исполнения требований настоящей Политики осуществляется ответственным за обеспечение безопасности персональных данных Организации.</p>

<p>8.4. Ответственность должностных лиц Организации, имеющих доступ к персональным данным, за невыполнение требований норм, регулирующих обработку и защиту персональных данных, определяется в соответствии с законодательством Российской Федерации и внутренними документами.</p>{/t}